import re


class ArmenianOrthographyConverter:
    vowel = 'ԱԵԷԸԻՈՕաեիէըոօ'
    sonant = 'ԲԳԴԶԹԺԼԽԾԿՀՁՂՃՄՅՆՇՉՊՋՌՍՎՏՐՑՓՔՖբգդզթժլխծկհձղճմյնշչպջռսվտրցւփքֆ'
    alphabet = 'ԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔևՕՖաբգդեզէըթժիլխծկհձղճմյնշոչպջռսվտրցւփքօֆ'
    alphabetWithoutH = 'ԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔևՕՖաբգդեզէըթժիլխծկձղճմյնշոչպջռսվտրցւփքօֆ'
    alphabetWithoutAOJ = 'ԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՆՇՉՊՋՌՍՎՏՐՑՒՓՔևՕՖբգդեզէըթժիլխծկհձղճմնշչպջռսվտրցւփքօֆ'
    End = '[^' + alphabet + '՞՜]|$'
    Start = '[^' + alphabet + ']|^'
    Data = [
        # Բառմիջում և բառավերջում ա, ե, ի ձայնավորներից հետո վ լսվելիս գրվում է ւ  # սա իրա մեջ ներառում է #  բառավերջում կամ ձայնավորից առաջ    իվ -> իւ
        [
            '([աեիԱԵԻ])վ',
            r'\1ւ',
            '([աեիԱԵԻ])ւ',
            r'\1վ'
        ],
        #  և - եւ
        [
            'և',
            'եւ',
            'եւ',
            'և'
        ],
        # բաղաձայնից առաջ    յու -> իւ
        [
            '([^' + vowel + ']|' + Start + ')յու([' + sonant + '])',
            r'\1իւ\2',
            '([^' + vowel + ']|' + Start + ')իւ([' + sonant + '])',
            r'\1յու\2'
        ],
        # TODO: ո -ից հետո վ -> ւ չի դառնում
        #
        # բարդ բառերում եթե երկրորդ բառը սկսվում է վ տառով, ապա վ մնում է,
        # օր․ ՝  պատմավէպ, կարեվէր, անվերջ
        # այս կետը բաց է մնում
        #
        #  ա, ե, է, ի, ո  ձայնավորներից առաջ, բաղաձայնից և յ կիսաձայնից հետո  վ -> ու
        [
            '([' + sonant + 'յ])վ([աեէիո])',
            r'\1ու\2',
            '([' + sonant + 'յ])ու([աեէիո])',
            r'\1վ\2'
        ],
        # բառավերջի ե -> է
        [
            '([' + alphabet + '])ե(' + End + ')',
            r'\1է\2',
            '([' + alphabet + '])է(' + End + ')',
            r'\1ե\2'
        ],
        # ույ -> ոյ    բոլոր իմ տեսած օրինակներում ույ-գտնվում է բաղաձայների մեջ, ինչպես նաև խուսափում ենք այնպիսի ոյան ազգանունների փոփոխելուց
        [
            '([' + sonant + '])ույ([' + sonant + '])',
            r'\1ոյ\2',
            '([' + sonant + '])ոյ([' + sonant + '])',
            r'\1ույ\2'
        ],
        # յա -> եա  /բայց ոչ բառասկզբում և ոչ ա, ո-ից հետո + յ տառից հետո
        [
            '([' + alphabetWithoutAOJ + '])յա',
            r'\1եա',
            '([' + alphabetWithoutAOJ + '])եա',
            r'\1յա'
        ],
        # յո -> եօ
        [
            r'յո([^ւ])',
            r'եօ\1',
            r'եօ',
            r'յո'
        ],
        # յո -> եօ
        [
            r'Յո([^ւ])',
            r'Եօ\1',
            'Եօ',
            'Յո'
        ],
        # բառասկզբում յ գրելու համար օրենք չկա պետք է հիշել այդ բառերը
        [
            'հ(ագե|ախճապակ|ախուռն|ածանա|ակինթ|աղթ|աճախ|ամառ|ամր|այտ|անդիման|անդուգն|անկարծ|անկերգ|անձ|անցագործ|անցանք|ապաղ|ապավ|ապաւ|աջող|աջորդ|առ|ասմիկ|ասպիս|ավերժ|ատակ|ատկ|ատուկ|արաբ|արազ|արգ|արդա|արձ|արմ|արութ|աւակ|աւել|աւելեալ|աւետ|աւէտ|աւիտ|ափշտակ|եղա|են|եսան|ետա|երյուրանք|իմար|իշ|իսն|իսուն|իրավի|ղ|ոբել|ոգն|ոդ|ոժար|ոխորտալ|ողդողդ|ոյզ|ոյժ|ոյս|ոնք|ոշոտ|ոպոպ|ոռի|ովազ|ովատակ|ովսե|որանջ|որդ|որդոր|որին|որձ|որջորջել|ուզ|ուլիս|ուղարկ|ույն|ույս|ունապ|ունիս|ունուար|ուշ|ուռթի|ուռութ|ուսա|ստակագեն)',
            r'յ\1',
            'յ(ագե|ախճապակ|ախուռն|ածանա|ակինթ|աղթ|աճախ|ամառ|ամր|այտ|անդիման|անդուգն|անկարծ|անկերգ|անձ|անցագործ|անցանք|ապաղ|ապավ|ապաւ|աջող|աջորդ|առ|ասմիկ|ասպիս|ավերժ|ատակ|ատկ|ատուկ|արաբ|արազ|արգ|արդա|արձ|արմ|արութ|աւակ|աւել|աւելեալ|աւետ|աւէտ|աւիտ|ափշտակ|եղա|են|եսան|ետա|երյուրանք|իմար|իշ|իսն|իսուն|իրավի|ղ|ոբել|ոգն|ոդ|ոժար|ոխորտալ|ողդողդ|ոյզ|ոյժ|ոյս|ոնք|ոշոտ|ոպոպ|ոռի|ովազ|ովատակ|ովսե|որանջ|որդ|որդոր|որին|որձ|որջորջել|ուզ|ուլիս|ուղարկ|ույն|ույս|ունապ|ունիս|ունուար|ուշ|ուռթի|ուռութ|ուսա|ստակագեն)',
            r'հ\1'
        ],
        # բառասկզբում յ գրելու համար օրենք չկա պետք է հիշել այդ բառերը
        [
            'Հ(ագե|ախճապակ|ախուռն|ածանա|ակինթ|աղթ|աճախ|ամառ|ամր|այտ|անդիման|անդուգն|անկարծ|անկերգ|անձ|անցագործ|անցանք|ապաղ|ապավ|ապաւ|աջող|աջորդ|առ|ասմիկ|ասպիս|ավերժ|ատակ|ատկ|ատուկ|արաբ|արազ|արգ|արդա|արձ|արմ|արութ|աւակ|աւել|աւելեալ|աւետ|աւէտ|աւիտ|ափշտակ|եղա|են|եսան|ետա|երյուրանք|իմար|իշ|իսն|իսուն|իրավի|ղ|ոբել|ոգն|ոդ|ոժար|ոխորտալ|ողդողդ|ոյզ|ոյժ|ոյս|ոնք|ոշոտ|ոպոպ|ոռի|ովազ|ովատակ|ովսե|որանջ|որդ|որդոր|որին|որձ|որջորջել|ուզ|ուլիս|ուղարկ|ույն|ույս|ունապ|ունիս|ունուար|ուշ|ուռթի|ուռութ|ուսա|ստակագեն)',
            r'Յ\1',
            'Յ(ագե|ախճապակ|ախուռն|ածանա|ակինթ|աղթ|աճախ|ամառ|ամր|այտ|անդիման|անդուգն|անկարծ|անկերգ|անձ|անցագործ|անցանք|ապաղ|ապավ|ապաւ|աջող|աջորդ|առ|ասմիկ|ասպիս|ավերժ|ատակ|ատկ|ատուկ|արաբ|արազ|արգ|արդա|արձ|արմ|արութ|աւակ|աւել|աւելեալ|աւետ|աւէտ|աւիտ|ափշտակ|եղա|են|եսան|ետա|երյուրանք|իմար|իշ|իսն|իսուն|իրավի|ղ|ոբել|ոգն|ոդ|ոժար|ոխորտալ|ողդողդ|ոյզ|ոյժ|ոյս|ոնք|ոշոտ|ոպոպ|ոռի|ովազ|ովատակ|ովսե|որանջ|որդ|որդոր|որին|որձ|որջորջել|ուզ|ուլիս|ուղարկ|ույն|ույս|ունապ|ունիս|ունուար|ուշ|ուռթի|ուռութ|ուսա|ստակագեն)',
            r'Հ\1'
        ],
        # բառավերջում ա -ից հետո դրվում է չկարդացվող յ, բացառություն են կազմում սա դա նա սրա դրա նրա, alphabetWithoutH-ով բացառում ենք հայ-ի դեպքը
        [
            '([' + alphabet + '][' + alphabetWithoutH + '])ա(' + End + ')',
            r'\1այ\2',
            '([' + alphabet + '][' + alphabetWithoutH + '])այ(' + End + ')',
            r'\1ա\2'
        ],
        # բառավերջում ո -ից հետո դրվում է չկարդացվող յ  # սա առանձնացվել է հատուկ հայ բառի պատճառով
        [
            '([' + alphabet + '])ո(' + End + ')',
            r'\1ոյ\2',
            '([' + alphabet + '])ոյ(' + End + ')',
            r'\1ո\2'
        ],
        # բառավերջի  են ->  Էն
        [
            '([' + alphabet + '])են(' + End + ')',
            r'\1էն\2',
            '([' + alphabet + '])էն(' + End + ')',
            r'\1են\2'
        ],
        # բառավերջի  եի ->  Էի
        [
            '([' + alphabet + '])եի(' + End + ')',
            r'\1էի\2',
            '([' + alphabet + '])էի(' + End + ')',
            r'\1եի\2'
        ],
        # նյու -> նիւ
        [
            '(' + Start + ')նյու(' + End + ')',
            r'\1նիւ\2',
            '(' + Start + ')նիւ(' + End + ')',
            r'\1նյու\2'
        ],
        # ում է/եք/են/
        [
            '([' + alphabet + '])եի(' + End + ')',
            r'\1էի\2',
            '([' + alphabet + '])էի(' + End + ')',
            r'\1եի\2'
        ]
        # /*
        #  #բառավերջի  ոն ->  օն
        #  [
        #  '([' + alphabet + '])ոն(\)',
        #  r'\1օն\2',
        #  '([' + alphabet + '])օն(\)',
        #  r'\1ոն\2'
        #  ]
        #  */
    ]
    # սխալների ուղղում կամ բացառություններ
    ErrorCorrectionSovietToMashtots = [
        ['սրայ', 'սրա'], ['Սրայ', 'Սրա'], ['դրայ', 'դրա'], ['Դրայ', 'Դրա'],
        ['նրայ', 'անոր'], ['Նրայ', 'Անոր'], ['հիմայ', 'հիմա'], ['Հիմայ', 'Հիմա'],
        ['ապայ', 'ապա'], ['Ապայ', 'Ապա'], ['նրայ', 'նրա'], ['Նրայ', 'Նրա'],
        ['ահայ', 'ահա'], ['Ահայ', 'Ահա'], ['այոյ', 'այո'], ['Այոյ', 'Այո'],
        ['աղայ', 'աղա'], ['Աղայ', 'Աղա'], ['փաշայ', 'փաշա'], ['Փաշայ', 'Փաշա'],
        ['ամիրայ', 'ամիրա'], ['Ամիրայ', 'Ամիրա'], ['կակաոյ', 'կակաո'], ['Կակաոյ', 'Կակաո'],
        ['այոյ', 'այո'], ['Այոյ', 'Այո'],
        ['Փօքր', 'Փոքր'], ['կօնք', 'կոնք'], ['Կօնք', 'Կոնք'],
        ['Վու', 'Ւու'], ['ուու', 'ւու'], ['Ուու', 'Ւու'],
        ['էւ', 'եւ'], ['Էւ', 'Եւ'], ['քոյ', 'քո'], ['Քոյ', 'Քո'],
        ['կա', 'կայ'], ['Կա', 'Կայ'], ['գա', 'գայ'], ['Գա', 'Գայ'],
        ['գեր', 'գէր'], ['Գեր', 'Գէր'], ['մնայ', 'մնա'],
        ['այեղագոռ', 'ահեղագոռ'], ['գէտնաթաղ', 'գետնաթաղ'], ['փետ', 'փէտ'],
        ['քանակապէս', 'քանակապես'], ['օք', 'ոք'], ['որբեվայրի', 'որբեւայրի'],
        ['մեկն', 'մէկն'], ['մեհէնապետ', 'մեհենապետ'], ['մատենաւար', 'մատենավար'],
        ['մասէրով', 'մասերով'], ['յունար', 'հունար'], ['նորայ', 'նորա'], ['ուներ', 'ունէր'],
        ['մահեր', 'մահէր']
    ]
    ErrorCorrectionSovietToMashtotsInTheWord = [
        ['ակադէմ', 'ակադեմ'],
        ['փօքր', 'փոքր'], ['վու', 'ւու'], ['աւէտ', 'աւետ'],
        ['յաւետ', 'յաւէտ'], ['գմբեթ', 'գմբէթ'], ['մեկ', 'մէկ'],
        ['թեպետ', 'թէպէտ'], ['Աբել', 'Աբէլ'],
        ['ուու', 'ւու'], ['սէրնդ', 'սերնդ'], ['սէրունդ', 'սերունդ'], ['ղեկաւար', 'ղեկավար'],
        ['Աւէտիք', 'Աւետիք'], ['Հակոբ', 'Յակոբ'], ['ազգէր', 'ազգեր'], ['ակտիւորէն', 'ակտիւօրէն'],
        ['ամենաւ', 'ամենավ'], ['ամենուր', 'ամէնուր'], ['սէրել', 'սերել'], ['սէրվ', 'սերվ'],
        ['անուերջ', 'անվերջ'], ['ւարձ', 'վարձ'], ['տոմսէր', 'տոմսեր'], ['եութիւն', 'էութիւն'],
        ['եղբոր', 'եղբօր'], ['երեկ', 'երէկ'], ['կէնդ', 'կենդ'],
        ['աեօվ', 'այով'], ['իդեալ', 'իդէալ'], ['կէնս', 'կենս'],
        ['իրէն', 'իրեն'], ['կէնտ', 'կենտ'], ['ոյան', 'ոյեան'], ['կէնս', 'կենս'], ['իրէն', 'իրեն'],
        ['խօստ', 'խոստ'], ['ծափայար', 'ծափահար'],
        ['յարաւ', 'հարաւ'], ['յարբ', 'հարբ'], ['յարիր', 'հարիր'], ['յարիւր', 'հարիւր'],
        ['յարց', 'հարց'], ['յենց', 'հենց'], ['յոդուած', 'յօդուած'],
        ['հօրդոր', 'յորդոր'], ['([^ո])ւառ', r'\1վառ'], ['հրեշ', 'հրէշ'],
        ['մայար', 'մահար'], ['ւայր', 'վայր'], ['որօնք', 'որոնք'], ['(' + Start + ')ցող', r'\1ցօղ'],
        ['պատայար', 'պատահար'], ['պոեմ', 'պօէմ'], ['հետո', 'յետո'],
        ['երէկո', 'երեկո'], ['հոլովակ', 'յոլովակ'],
        ['սկավառ', 'սկաւառ'], ['մէկն', 'մեկն'], ['մեքէնա', 'մեքենա'],
        ['րոպե', 'րոպէ'], ['հրեա', 'հրէա'],
        ['շատէր', 'շատեր'], ['պատէր', 'պատեր'], ['կնուիրուէն', 'կնուիրուեն'],
        ['([' + alphabet + '])յարութ', r'\1հարութ'],
        ['ւստահ', 'վստահ'], ['ուախճան', 'վախճան'], ['ատօք', 'ատոք'],
        ['գավառ', 'գաւառ'], ['ւճար', 'վճար'], ['ւաճառ', 'վաճառ'],
        ['([^ո])ւար(ութիւն|ման)', r'\1վար\2'], ['դէմիրճեան', 'դեմիրճեան'], ['եդէմ', 'եդեմ'],
        ['ժողւուրդ', 'ժողովուրդ'], ['ինտէ', 'ինտե'], ['ւիճակ', 'վիճակ'], ['լամլամօրել', 'լամլամորել'],
        ['խռւ', 'խռով'], ['ւիժ', 'վիժ'], ['դրօշմ', 'դրոշմ'], ['կառլէն', 'կառլեն'], ['մօրթ', 'մորթ'],
        ['կինո([^ւ])', r'կինօ\1'], ['ուզէնք', 'ուզենք'],
        ['համւ', 'համով'], ['հաշւէ', 'հաշուե'], ['յարմոն', 'հարմոն'],
        ['(' + Start + ')հարատ', r'\1յարատ'], ['(' + Start + ')հօնք', r'\1յօնք'],
        ['հէգն', 'հեգն'], ['հոգսէր', 'հոգսեր'], ['հւուեր', 'հովուեր'],
        ['հրէշտակ', 'հրեշտակ'], ['զգէստ', 'զգեստ'], ['մէտաքս', 'մետաքս'],
        ['ւարս', 'վարս'], ['մտէրմ', 'մտերմ'], ['յետամուտ', 'հետամուտ'], ['նուիրատւութ', 'նուիրատուութ'],
        ['շմօր', 'շմոր'], ['շոգէ', 'շոգե'], ['շոեօղ', 'շոյող'], ['ոգէշնչ', 'ոգեշնչ'],
        ['րօրակ', 'րորակ'], ['պատուեր', 'պատուէր'], ['սավառն', 'սաւառն'],
        ['ւարժակ', 'վարժակ'], ['սէրմ', 'սերմ'], ['([^խ])որէն', r'\1օրէն'], ['սէրտ', 'սերտ'],
        ['սոսնձու(մ|կ)', r'սօսնձու\1'], ['մօտոր', 'մոտոր'], ['օրթոդօքս', 'օրթոդոքս'], ['չարէնց', 'չարենց'],
        ['չէզօք', 'չէզոք'], ['ունէն', 'ունեն'], ['չօք', 'չոք'], ['համառոտ', 'համառօտ'], ['ւիպ', 'վիպ'],
        ['պարգեւատւ', 'պարգեւատու'], ['պարկէտ', 'պարկետ'], ['ուարչութ', 'վարչութ'], ['պէտքաղ', 'պետքաղ'],
        ['պլեբեեա', 'պլեբէյա'], ['պլեբեյ', 'պլեբէյ'], ['իւեր', 'իվեր'], ['դիվեր', 'դիւեր'], ['ունիվերս', 'ունդիւերս'],
        ['ուէժ', 'վէժ'], ['ցողել', 'ցօղել'], ['ռեակտ', 'ռէակտ'], ['էրէն', 'երէն'], ['սաժէն', 'սաժեն'],
        ['սէրակեր', 'սերակեր'], ['սէրգեյ', 'սերգեյ'], ['սէրժ', 'սերժ'], ['սէրհատ', 'սերհատ'],
        ['սէրում', 'սերում'], ['սթիւէն', 'սթիւեն'], ['ահօտ', 'ահոտ'], ['սկէս', 'սկես'], ['սուէտ', 'սովետ'],
        ['սովօրէ', 'սովորե'], ['ուսէր', 'ուսեր'], ['ստամօքս', 'ստամոքս'], ['ւայել', 'վայել'], ['օրդ', 'որդ'],
        ['վաշինգտօն', 'վաշինգտոն'], ['ւազք', 'վազք'], ['էնի', 'ենի'], ['վեյանձ', 'վեհանձ'],
        ['վերասէր', 'վերասեր'], ['վյատակ', 'վհատակ'], ['ւուշա', 'վուշա'], ['վրդւ', 'վրդով'],
        ['էրորդ', 'երորդ'], ['ւախութիւն', 'վախութիւն'], ['ւ([եէ])րջ', 'վ\1րջ'], ['տարօրոշ', 'տարորոշ'],
        ['տեղեկատւու', 'տեղեկատուու'], ['տէրեւ', 'տերեւ'], ['աւարդ', 'ավարդ'], ['տէրիտորիա', 'տերիտորիա'],
        ['տեւտօն', 'տեւտոն'], ['սուար', 'սվար'], ['լեօզ', 'լյոզ'], ['տրիտօն', 'տրիտոն'], ['յառաչ', 'հառաչ'],
        ['ցրտաւար', 'ցրտավար'], ['ուանկ', 'վանկ'], ['(հաշ|ուր)վանկ', r'\1ուանկ'], ['փետ(անալ|ացնել)', r'փէտ\1'],
        ['աւարական', 'ավարական'], ['ուարական', 'վարական'], ['րւութիւն', 'րովութիւն'], ['քուեա', 'քուէա'],
        ['(' + Start + '|հանրա)քուեն', r'\1քուէն'], ['քրեա', 'քրէա'], ['քրիստօ', 'քրիստո'],
        ['ֆեստօն', 'ֆէստոն'], ['ֆեստիւալ', 'ֆէստիվալ'], ['մէտր', 'մետր'], ['բորբօք', 'բորբոք'],
        ['(' + Start + ')որդէ', r'\1որդե'], ['ոսկեցող', 'ոսկեցօղ'], ['ոսկէ([' + alphabet + '])', r'ոսկե\1'],
        ['ուէմ', 'ուեմ'], ['ողօք', 'ողոք'], ['ոլօք', 'ոլոք'], ['ոգէթափանց', 'ոգեթափանց'],
        ['շերտէր', 'շերտեր'], ['շաքարօտ', 'շաքարոտ'], ['ուաստակ', 'վաստակ'], ['նվաստական', 'նուաստական'],
        ['պատվաստակ', 'պատուաստակ'], ['շայատ', 'շահատ'], ['էնուէր', 'էնուեր'], ['ցնէն', 'ցնեն'],
        ['յետախուզ', 'հետախուզ'], ['յետազօտ', 'հետազօտ'], ['նայատակ', 'նահատակ'], ['հիմնահատակ', 'հիմնահատակ'],
        ['հունաստան', 'յունաստան'], ['(' + Start + ')յագո', r'\1եագո'], ['մորմօք', 'մորմոք'],
        ['(' + Start + ')մոր(' + End + '|ա|եղբ|ով|ը|ուք)', r'\1մօր\2'], ['մօտո', 'մոտո'],
        ['մոլիբդէն', 'մոլիբդեն'], ['տւութե', 'տուութե'], ['րօնք', 'րոնք'], ['մեքենաւար', 'մեքենավար'],
        ['մէտաղ', 'մետաղ'], ['մէկուս', 'մեկուս'], ['կէնցաղ', 'կենցաղ'], ['մարգագէտ', 'մարգագետ'],
        ['ւեներա', 'վեներա'], ['(' + Start + ')մանուել', r'\1մանուէլ'], ['մանկաւարժ', 'մանկավարժ'],
        ['մաեօր', 'մայոր'], ['մակոյկաւար', 'մակոյկավար'], ['հաշուառուել', 'հաշվառուել'],
        ['մակէտ', 'մակետ'], ['ճանապարյորդ', 'ճանապարհորդ'], ['ձրիաւարժ', 'ձրիավարժ'],
        ['կոիւղ', 'կոյուղ'], ['իւղարկաւ', 'յուղարկաւ'], ['կուէն', 'կուեն'], ['հրէայկան', 'հրէական'],
        ['հրամաեօղական', 'հրամայողական'], ['հուսով', 'յուսով'], ['(' + Start + ')հունա', r'\1յունա'],
        ['հորջորջ', 'յորջորջ'], ['(' + Start + ')հուդա', r'\1յուդա'], ['հօրել', 'հորել'],
        ['հորապապ', 'հօրապապ'], ['հօտ(ե|առու|ածու)', r'հոտ\1'], ['յովսեփ', 'յովսէփ'],
        ['հովհաննես', 'յովհաննէս'], ['յոշոտ', 'յօշոտ'], ['յոդ', 'յօդ'], ['ֆյօդ', 'ֆյոդ'],
        ['ուիրայատ', 'վիրահատ'], ['հետ(շեշտ|նամաս|մահու)', r'յետ\1'], ['յետա(քրք|պնդ|խոյզ|զնն)', r'հետա\1'],
        ['հեռւու', 'հեռուու'], ['հէնուե', 'յենուե'], ['(' + Start + ')հէնա', r'\1յենա'],
        ['հեղկոմ', 'յեղկոմ'], ['ւաշտ', 'վաշտ'], ['հափր', 'յափր'], ['հարուց', 'յարուց'],
        ['(' + Start + ')հարա(շունչ|կց|կէզ|կա|դր)', r'\1յարա\2'], ['հաւերժ', 'յաւէրժ'],
        ['հաչաղ', 'յաչաղ'], ['տւութիւն', 'տուութիւն'], ['(' + Start + ')հանցա', r'\1յանցա'],
        ['հանդգն', 'յանդգն'], ['հանգստաւետ', 'հանգստաւէտ'], ['հանգաւոր', 'յանգաւոր'], ['հայհոյեանք', 'հայհոյանք'],
        ['հայեացրիր', 'հայացրիր'], ['յամրովի', 'համրովի'], ['համէտ', 'համետ'], ['յամառոտ', 'համառօտ'],
        ['փորձէ', 'փորձե'], ['ուերականգն', 'վերականգն'], ['ւարուհի', 'վարուհի'], ['կօքս', 'կոքս'],
        ['կոնսէր', 'կոնսեր'], ['կոնգրէսմէն', 'կոնգրէսմեն'], ['կներեք', 'կներէք'], ['կմտածեր', 'կմտածէր'],
        ['ւարժեցուել', 'վարժեցուել'], ['կիրակօս', 'կիրակոս'], ['կիլո', 'կիլօ'], ['կէսէր', 'կէսեր'], ['կէսար', 'կեսար'],
        ['կէնաց', 'կենաց'], ['կէնակց', 'կենակց'], ['կարէնալ', 'կարենալ'], ['կատէգորիկ', 'կատեգորիկ'],
        ['կառաւար', 'կառավար'], ['կայսէր', 'կայսեր'], ['ծառաեօղ', 'ծառայող'], ['ծակօսկր', 'ծակոսկր'],
        ['խոտէր', 'խոտեր'], ['խօսրով', 'խոսրով'], ['խոսել', 'խօսել'], ['ծուատում', 'ծվատում'], ['խօլորում', 'խոլորում'],
        ['խօլամիտ', 'խոլամիտ'], ['թուխմօրուք', 'թուխմորուք'], ['խաղաղաւետ', 'խաղաղաւէտ'], ['լապտէր', 'լապտեր'],
        ['թուին', 'թւին'], ['թօքախոտ', 'թոքախոտ'], ['թօնրատուն', 'թոնրատուն'], ['թիաւարում', 'թիավարում'],
        ['թերաւարժ', 'թերավարժ'], ['թէեա', 'թէյա'], ['սօլիկ', 'սոլիկ'], ['թատէր(գ|ա)', r'թատեր\1'], ['էվո', 'էւո'],
        ['էստօն', 'էստոն'], ['էներգէտիկա', 'էներգետիկա'], ['էշաւար', 'էշավար'], ['զօրաւար', 'զօրավար'],
        ['զւունի', 'զովունի'], ['զինաւար', 'զինավար'], ['զէնդերէն', 'զենդերէն'], ['օդիժէն', 'օդիժեն'], ['օգօստոս', 'օգոստոս'],
        ['փաստէրը', 'փաստերը'], ['յոլով', 'հոլով'], ['սկաւառն', 'սկավառն'], ['ռօք', 'ռոք'], ['ռեակցիան', 'ռէակցիան'],
        ['պրոդիւսէր', 'պրոդիւսեր'], ['պետէրբուրգ', 'պետերբուրգ'], ['պասսէն', 'պասսեն'], ['մարիեայ', 'մարիյայ'],
        ['մանժէտ', 'մանժետ'], ['մայայ', 'մայա'], ['մաստէր', 'մաստեր'], ['հրաժէտ', 'հրաժետ'],
        ['յետաքն', 'հետաքն'], ['յարազատ', 'հարազատ'], ['յագել', 'հագել'], ['կրտսէրը', 'կրտսերը'],
        ['կրծքաւանդակ', 'կրծքավանդակ'], ['կարծէս', 'կարծես'], ['ատէգորիաներ', 'ատեգորիանէր'],
        ['կատարէց', 'կատարեց'], ['թօքային', 'թոքային'], ['ամենայ', 'ամենա'], ['ամենաայտնի', 'ամենայայտնի'],
        ['ամենաաջող', 'ամենայաջող'], ['ամեն(ը|ի)', r'ամէն\1'], ['ամերիկայ(' + End + ')', r'ամերիկա\1'],
        ['այլօք', 'այլոք'], ['այնուամենանիւ', 'այնուամենայնիւ'], ['այտէրը', 'այտերը'], ['անգլերէն', 'անգլերեն'],
        ['անովէրջ', 'անվերջ'], ['առուիզոյի', 'առվիզոյի'], ['ատրէն', 'ատրեն'], ['արէնայ', 'արենայ'],
        ['բանտէր', 'բանտեր'], ['բերէց', 'բերեց'], ['բօքս', 'բոքս'], ['բիւջէն', 'բիւջեն'],
        ['(դրու|տան|ստիպ|սպան|պարզ|կռու|որոշ|կոյս|ճանաչ|հասն|յանձնու|կատար|լուծ|զբաղու|գտնու|' +
            'գործ|կարծ|կարլ|ւորու|աշխատ|անցկացու|խայտ|տեսն|պատրաստ|համեմատ|ներառ|' +
            'աւելացու|ինչպիսիք)է(մ|ն|ր)', r'\1ե\2'],
        ['(բարելաւ)եր', r'\1էր'],
        ['(' + Start + ')կտրոն', r'\1կտրօն'],
        ['(' + Start + ')կ(հ|յ|լին|մնա|վնաս|փորձ|տեսն|տեղադր|տան|վերա|ստիպ|ստան|սպան|սկս|սիր|պաշտպան|պարզ|պահ|' +
            'շարունակ|նստ|նայ|մեռն|ձեռնարկ|խօս|կա|դնի|բեր|զբաղ|դադար|դարձ|գա|ներ|մտած|ճանաչ|լսեմ|' +
            'խանգար|լուծ|թուա|թողն|գտնու|գործ|բացու|տայ|ղբաղեցն|դառնա|բարելաւ|բաժանուի)', r'\1կը \2'],
        ['(' + Start + ')կ(ուղարկ|ուզէ|որոշ|ուզեն|ունե|իրական|ընձեռ|ընդուն|ըլն|երթա|ելն|աւերի|ասենք|առնի|ապացուց|' +
            'աշխատ|անցկացու|անեմ|ոպպոլայ|արոլինայ|ատրինայ|ատեգորիանէր|աւելացու|անցկացն|անի)', r'\1կ\'\2']
    ]
    errorCorrectionMashtotsToSovietInTheWord = [
        ['([^ոե])ւ', r'\1վ'],
        ['փօքր', 'փոքր'], ['ւու', 'վու'],
        ['հրավէր', 'հրավեր'], ['հրէշ', 'հրեշ'],
        ['յաւէտ', 'հավետ'], ['գմբէթ', 'գմբեթ'], ['մէկ', 'մեկ'], ['յոլովակ', 'հոլովակ'],
        ['թէպէտ', 'թեպետ'], ['Աբէլ', 'Աբել'],
        ['մանրէ', 'մանրե'], ['սէրնդ', 'սերնդ'],
        ['սէրունդ', 'սերունդ'], ['ղեկաւար', 'ղեկավար'], ['Յակոբ', 'Հակոբ'],
        ['ակտիւօրէն', 'ակտիւորէն'], ['ամենաւ', 'ամենավ'], ['ամէնուր', 'ամենուր'],
        ['սէրել', 'սերել'], ['սէրվ', 'սերվ'], ['անուերջ', 'անվերջ'],
        ['տոմսէր', 'տոմսեր'], ['բարոր', 'բարօր'],
        ['եղբօր', 'եղբոր'], ['երէկ', 'երեկ'],
        ['այով', 'աեօվ'], ['իդէալ', 'իդեալ'], ['յետո', 'հետո'],
        ['ոյեան', 'ոյան'], ['հաշիւ', 'հաշիվ'], ['յօդուած', 'յոդուած'], ['յորդոր', 'հորդոր'],
        ['ցօղ', 'ցող'], ['հրաւէր', 'հրավեր'],
        ['սկաւառ', 'սկավառ'], ['պօէմ', 'պոեմ'], ['րոպէ', 'րոպե'],
        ['(' + Start + ')ևա(ան|յի|ին|ից|ով)(' + End + ')', 'եվա\2'],
        ['կը ', 'կ'], ['կինօ', 'կինո'], ['կոլեկտյու', 'կոլեկտիվ'],
        ['կ\'', 'կ'], ['նահենք', 'նայենք'], ['պատվէր', 'պատվեր'],
        ['տօրեն', 'տորեն'], ['([^ատ]|[' + alphabet + '][ա])նօրեն', r'\1նորեն'],
        ['սօսնձ', 'սոսնձ'], ['տարիե', 'տարիէ'], ['պահուսակ', 'պայուսակ'],
        ['(' + Start + ')յարատ', r'\1հարատ'], ['առօտ', 'առոտ'], ['պարզապես', 'պարզապէս'],
        ['վենեսվելա', 'վենեսուելա'], ['վէստ', 'վեստ'], ['փէտ(անալ|ացնել)', r'փետ\1'],
        ['պլեբէյ', 'պլեբեյ'], ['աղվէս', 'աղվես'], ['ռէակտ', 'ռեակտ'], ['իօրեն', 'իորեն'],
        ['որինակ', 'օրինակ'], ['(' + Start + ')րոպյա', r'\1րոպեա'], ['քվէա', 'քվեա'],
        ['մանրե([^լ])', r'մանրէ\1'], ['ոքսիդ', 'օքսիդ'], ['օրեն(' + End + ')', r'որեն\1'],
        ['քվէն', 'քվեն'], ['քրէա', 'քրեա'], ['ֆէստ(ոն|իվալ)', r'ֆեստ\1'], ['յունաստան', 'հունաստան'],
        ['հառաջ', 'յառաջ'], ['(' + Start + ')եագո', r'\1յագո'], ['(' + Start + ')մօր', r'\1մոր'],
        ['մանվէլ', 'մանվել'], ['հրէական', 'հրեական'], ['յուսով', 'հուսով'], ['(' + Start + ')յունա', r'\1հունա'],
        ['յորջորջ', 'հորջորջ'], ['(' + Start + ')յուդա', r'\1հուդա'], ['հօրապապ', 'հորապապ'], ['յովսէփ', 'հովսեփ'],
        ['յովհաննէս', 'հովհաննես'], ['հովյու', 'հովիվ'], ['յօշոտ', 'հոշոտ'], ['յետ', 'հետ'],
        ['յեղկոմ', 'հեղկոմ'], ['յափր', 'հափր'], ['յարուց', 'հարուց'], ['օդաչվ', 'օդաչու'],
        ['(' + Start + ')յարա(շունչ|կց|կեզ|կա|դր)', r'\1հարա\2'], ['յավէրժ', 'հավերժ'],
        ['յավետ', 'հավետ'], ['հասցյ', 'հասցե'], ['յաչաղ', 'հաչաղ'], ['(' + Start + ')յանցա', r'\1հանցա'],
        ['յանդգն', 'հանդգն'], ['յանգավոր', 'հանգավոր'], ['(' + Start + ')կտրօն', r'\1կտրոն'], ['կռյու', 'կռիվ'],
        ['կներէք', 'կներեք'], ['կմտածէր', 'կմտածեր'], ['կլիմահա', 'կլիմայա'], ['կիլօ', 'կիլո'],
        ['գործունէություն', 'գործունեություն'], ['ինտելեկտվալ', 'ինտելեկտուալ'], ['ինդիվիդվալ', 'ինդիվիդուալ'],
        ['(' + Start + ')քրյա', r'\1քրեա'], ['տնորեն', 'տնօրեն'], ['ռէակցիան', 'ռեակցիան'],
        ['հաշյուների', 'հաշիվների'], ['բարելավէր', 'բարելավեր'], ['ատեգորիանէր', 'ատեգորիաներ'],
        ['կօշիկնէր', 'կոշիկնէր'], ['լյուիս', 'լիւիս'], ['ամէն(ը|ի)', r'ամեն\1'], ['այնվամենայնիվ', 'այնուամենայնիվ'],
        ['թեմաեօվ', 'թեմայով']
    ]
    errorCorrectionMashtotsToSoviet = [
        ['խո', 'խոյ'], ['Խո', 'Խոյ'], ['Նո', 'Նոյ'], ['կայ', 'կա'],
        ['Կայ', 'Կա'], ['մանրե', 'մանրէ'], ['գէր', 'գեր'],
        ['Գէր', 'Գեր'], ['չե', 'չէ'], ['Չե', 'Չէ'], ['տարորինակ', 'տարօրինակ'],
        ['անոթևան', 'անօթևան'], ['հրյա', 'հրեա'], ['չեի', 'չէի'], ['տերը', 'տէրը'],
        ['փէտ', 'փետ'], ['շվուոց', 'շվվոց'], ['ունէր', 'ուներ'], ['մահէր', 'մահեր']
    ]
    #ածանցներ և արմատներ, որոնք պետք է ուղղակի հիշվեն
    WordsParts = [
        ['ավոր', 'աւոր'], ['վետ', 'ւէտ'], ['ավուն', 'աւուն'], ['զեն', 'զէն'],
        ['դեմ', 'դէմ'], ['դեպ', 'դէպ'], ['տեր', 'տէր'],
        ['աղետ', 'աղէտ'], ['արժեք', 'արժէք'], ['արեն', 'արէն'],
        ['գետ', 'գէտ'], ['դեպ', 'դէպ'], ['դետ', 'դէտ'],
        ['եղեն', 'եղէն'], ['հրեերեն', 'հրէերէն'], ['երեն', 'երէն'], ['երեց', 'երէց'],
        ['կեն', 'կէն'], ['կետ', 'կէտ'], ['մետ', 'մէտ'], ['մեջ', 'մէջ'],
        ['շեն', 'շէն'], ['պես', 'պէս'], ['սեր', 'սէր'], ['վեժ', 'վէժ'],
        ['վեպ', 'վէպ'], ['վերք', 'վէրք'], ['վրեպ', 'վրէպ'], ['քեն', 'քէն'],
        ['օրեն', 'օրէն'], ['աղեկեզ', 'աղեկէզ'], ['աղետ', 'աղէտ'],
        ['աղվես', 'աղուէս'], ['անզեն', 'անզէն'],
        ['անեծք', 'անէծք'], ['անշեջ', 'անշէջ'], ['աշղետ', 'աշղէտ'], ['ապավեն', 'ապաւէն'],
        ['գեթ', 'գէթ'], ['գեշ', 'գէշ'], ['գես', 'գէս'],
        ['գմբեթ', 'գմբէթ'], ['գոմեշ', 'գոմէշ'], ['դեզ', 'դէզ'], ['դեմ', 'դէմ'],
        ['ապաքեն', 'ապաքէն'], ['առնետ', 'առնէտ'], ['ասպարեզ', 'ասպարէզ'],
        ['արալեք', 'արալէք'], ['արժեք', 'արժէք'], ['բզեզ', 'բզէզ'], ['բվեճ', 'բուէճ'],
        ['բրետ', 'բրէտ'], ['զենք', 'զէնք'], ['զենիթ', 'զէնիթ'], ['ընդդեմ', 'ընդդէմ'],
        ['ընկեց', 'ընկէց'], ['թեև', 'թէև'], ['թեժ', 'թէժ'], ['թեպետ', 'թէպէտ'],
        ['ժամկետ', 'ժամկէտ'], ['ժապավեն', 'ժապաւէն'], ['լեգեոն', 'լեգէոն'],
        ['խաբեություն', 'խաբէութիւն'], ['խեթ', 'խէթ'], ['խեժ', 'խէժ'], ['խլեզ', 'խլէզ'],
        ['ծես', 'ծէս'], ['ծովահեն', 'ծովահէն'], ['ծվեն', 'ծուէն'], ['կեզ', 'կէզ'],
        ['կես', 'կէս'], ['կողպեք', 'կողպէք'], ['կուզեկուզ', 'կուզէկուզ'], ['դեմք', 'դէմք'],
        ['դեն', 'դէն'], ['դեպի', 'դէպի'], ['դեպք', 'դէպք'], ['ելակետ', 'ելակէտ'],
        ['ելևեջ', 'ելևէջ'], ['եզեգ', 'եզէգ'], ['մեգ', 'մէգ'], ['մեզ', 'մէզ'], ['մեկ', 'մէկ'],
        ['մեջ', 'մէջ'], ['մետ', 'մէտ'], ['մողես', 'մողէս'],
        ['հավետ', 'յաւէտ'], ['հետադեմ', 'յետադէմ'], ['նշանդրեք', 'նշանդրէք'], ['նվեր', 'նուէր'],
        ['շահեն', 'շահէն'], ['շեկ', 'շէկ'], ['շեն', 'շէն'], ['ողջակեզ', 'ողջակէզ'],
        ['ուղեշ', 'ուղէշ'], ['չեզոք', 'չէզոք'], ['պանթեոն', 'պանթէոն'], ['պարեն', 'պարէն'],
        ['պարետ', 'պարէտ'], ['պարտեզ', 'պարտէզ'], ['պետք', 'պէտք'], ['պնակալեզ', 'պնակալէզ'],
        ['կրետ', 'կրէտ'], ['հանպեդ', 'հանդէպ'], ['հանդես', 'հանդէս'],
        ['հեգ', 'հէգ'], ['հելլեն', 'հելլէն'], ['հեն', 'հէն'], ['հյուսկեն', 'հիւսկէն'],
        ['հրավեր', 'հրաւէր'], ['հրեշ', 'հրէշ'], ['հրշեջ', 'հրշէջ'],
        ['ձեթ', 'ձէթ'], ['տեգ', 'տէգ'], ['տերունական', 'տէրունական'], ['տերտեր', 'տէրտէր'],
        ['տնօրեն', 'տնորէն'], ['փոխարեն', 'փոխարէն'], ['ջրվեժ', 'ջրվէժ'], ['ջրօրհնեք', 'ջրօրհնէք'],
        ['սեգ', 'սէգ'], ['սեզ', 'սէզ'], ['սպառազեն', 'սպառազէն'], ['վեճ', 'վէճ'], ['վեմ', 'վէմ'],
        ['վեպ', 'վէպ'], ['վէս', 'վես'], ['վերք', 'վէրք'], ['վրեժ', 'վրէժ'], ['տարեց', 'տարէց'],
        ['փրփադեզ', 'փրփրադէզ'], ['քարտեզ', 'քարտէզ'], ['քեն', 'քէն'],
        ['քնեած', 'քնէած'], ['քրեական', 'քրէական'],
        ['աղոթք', 'աղօթք'], ['աղոտ', 'աղօտ'], ['անոթ', 'անօթ'],
        ['առավոտ', 'առաւօտ'], ['արոտ', 'արօտ'], ['արոր', 'արօր'],
        ['դրոշ', 'դրօշ'], ['զբոսն', 'զբօսն'], ['զգոն', 'զգօն'],
        ['զոդ', 'զօդ'], ['զոր', 'զօր'], ['թափոր', 'թափօր'], ['թոշն', 'թօշն'], ['խոս', 'խօս'],
        ['կրոն', 'կրօն'], ['հոտ', 'հօտ'], ['ճոճ', 'ճօճ'], ['մոտ', 'մօտ'], ['տոն', 'տօն'],
        ['օրոր', 'օրօր'], ['ոք', 'օք'], ['ոնք', 'օնք'], ['եոք', 'եօք'],
        ['անեծք', 'անէծք'], ['լեգեոն', 'լեգէոն'], ['կուզեկուզ', 'կուզէկուզ'],
        ['պանթեոն', 'պանթէոն'], ['ախպեր', 'ախպէր'], ['քրեական', 'քրէական'],
        ['չեզոք', 'չէզոք'], ['պետք', 'պէտք'], ['հրեա', 'հրէայ'],
        ['պարետ', 'պարէտ'], ['քարտեզ', 'քարտէզ'], ['շեջ', 'շէջ'], ['պարտեզ', 'պարտէզ'],
        ['ընկեց', 'ընկէց'], ['ժետ', 'ժէտ'], ['կեզ', 'կէզ'],
        ['հանդես', 'հանդէս'], ['հրավեր', 'հրավէր'], ['եիր', 'էիր'], ['եիք', 'էիք'],
        ['եոս', 'էոս'], ['եաս', 'էաս'],
        ['ակոս', 'ակօս'], ['աղորիք', 'աղօրիք'], ['ամոթ', 'ամօթ'],
        ['ապարոշ', 'ապարօշ'], ['արտոսր', 'արտօսր'],
        ['բռնազբոսիկ', 'բռնազբօսիկ'], ['բոթ', 'բօթ'], ['գոշ', 'գօշ'],
        ['գոս', 'գօս'], ['գոտի', 'գօտի'], ['դոդոշ', 'դօդօշ'],
        ['զոշաքաղ', 'զօշաքաղ'], ['թոթափ', 'թօթափ'], ['թոն', 'թօն'],
        ['թոթվել', 'թօթուել'], ['լոթի', 'լօթի'], ['լոլիկ', 'լօլիկ'], ['խոլ', 'խօլ'],
        ['ծանոթ', 'ծանօթ'], ['ծղոտ', 'ծղօտ'], ['ծնոտ', 'ծնօտ'],
        ['կարոտ', 'կարօտ'], ['կոշիկ', 'կօշիկ'], ['հետազոտ', 'հետազօտ'],
        ['ձոն', 'ձօն'], ['ղողանջ', 'ղօղանջ'], ['յոդ', 'յօդ'], ['հոժար', 'յօժար'],
        ['հոնք', 'յօնք'], ['հորանջ', 'յօրանջ'],
        ['հորին', 'յօրին'], ['նարոտ', 'նարօտ'], ['պռոշ', 'պռօշ'],
        ['սոլ', 'սօլ'], ['սոսի', 'սօսի'], ['սոսափ', 'սօսափ'],
        ['վառոդ', 'վառօդ'], ['տոթ', 'տօթ'], ['քող', 'քօղ'], ['հայաց', 'հայեաց'],
        ['Գայանե', 'Գայեանէ'], ['դայակ', 'դայեակ'], ['աերո', 'աէրո'], ['ավտո', 'աւտօ'],
        ['բեյրութ', 'բէյրութ'], ['գրավվե', 'գրաւուե'], ['գրավվի', 'գրաւուի'],
        ['վեք', 'ուէք'], ['եյան', 'եյեան'], ['փեշ', 'փէշ'], ['նեին', 'նէին'],
        ['հանգե', 'յանգե'], ['հեյ', 'հէյ'], ['մանյովր', 'մանեօւր'], ['մովսես', 'մովսէս'],
        ['շեֆական', 'շէֆական'], ['պեծպծալի', 'պէծպծալի'], ['ռադիո', 'ռադիօ'],
        ['չերքեզի', 'չէրքէզի'], ['պատճե', 'պատճէ'], ['պատնեշ', 'պատնէշ'], ['պարգևվել', 'պարգեւուել'],
        ['պեծ', 'պէծ'], ['պոեզիա', 'պօէզիա'], ['պրոֆես', 'պրոֆէս'], ['ջահել', 'ջահէլ'],
        ['ռաֆայել', 'ռաֆայէլ'], ['սամվել', 'սամուէլ'], ['սվերդ', 'սուերդ'], ['սվեր', 'սուէր'],
        ['տվյալ', 'տուեալ'], ['փոխնեփոխ', 'փոխնէփոխ'], ['վույտ', 'ուոյտ'], ['օվկիան', 'ովկիան'],
        ['օրեցօր', 'օրէցօր'], ['հաբեշ', 'հաբէշ'], ['հածել', 'յածել'], ['հակոբ', 'յակոբ'],
        ['ոստրեբուծական', 'ոստրէբուծական'], ['շվեդ', 'շուէդ'], ['շոշափել', 'շօշափել'],
        ['շոշափել', 'շօշափել'], ['մորուս', 'մօրուս'], ['շեյխ', 'շէյխ'], ['շարվեշար', 'շարուէշար'],
        ['նորվեգ', 'նորուէգ'], ['նոսր', 'նօսր'], ['նոթ', 'նօթ'], ['յանուկովիչ', 'եանուկովիչ'],
        ['յամբ', 'եամբ'], ['միքայել', 'միքայէլ'], ['մերացու', 'մէրացու'], ['մեծավերջ', 'մեծավէրջ'],
        ['ձյութա', 'ձիւթա'], ['յուղ', 'իւղ'], ['ձենն', 'ձէնն'], ['հոդս', 'յօդս'], ['հորս', 'հօրս'],
        ['հստակ', 'յստակ'], ['հորե', 'հօրե'], ['հինգլեզվ', 'հինգլեզու'], ['հանրաքվե', 'հանրաքուէ'],
        ['օրհնեք', 'օրհնէք'], ['կռճոն', 'կռճօն'], ['կորցրեք', 'կորցրէք'], ['կոշկա', 'կօշկա'],
        ['կոնգրես', 'կոնգրէս'], ['կաղեկաղ', 'կաղէկաղ'], ['կախեք', 'կախէք'], ['ծեգաբաց', 'ծէգաբաց'],
        ['խելահեղ', 'խելայեղ'], ['մորուք', 'մօրուք'], ['լիներ', 'լինէր'], ['լեոյի', 'լէոյի'], ['իսրայել', 'իսրայէլ'],
        ['թոզոտվել', 'թօզոտուել'], ['թեյ', 'թէյ'], ['զոռ', 'զօռ'], ['զբոս', 'զբօս'], ['ֆոնս', 'ֆօնս'],
        ['օգոտոս', 'օգօտոս'], ['րայան', 'րայեան'], ['տեղեր', 'տեղէր'], ['վիդեո', 'վիդէո'], ['սքվեր', 'սքուէր'],
        ['սոպրանո', 'սոպրանօ'], ['յակում', 'եակում'], ['ձեռնոցներ', 'ձեռնոցնէր'], ['հասցե', 'հասցէ'],
        ['կրունկներ', 'կրունկնէր'], ['կրամեր', 'կրամէր'], ['խորեոգրաֆ', 'խորէոգրաֆ'], ['ժամեր', 'ժամէր'],
        ['Ավոն', 'Աւօն'], ['այցելեք', 'այցելէք'], ['արետտա', 'արէտտայ'], ['թողարկվեր', 'թողարկուէր'],
        ['դասընթացներ', 'դասընթացնէր'], ['գործունեության', 'գործունէութեան']
    ]

    def replace(text, expression, replacement, isShowPath):
        temp = text
        text = re.sub(expression, replacement, text)
        #print(f"temp: {temp}\ntext: {text}")
        # if "յան" in expression or "եան" in expression:
        #     print(f"exp: {expression}\nrep: {replacement}\n")
        # if isShowPath and temp != text:
        #     print(temp + '->' + text + ' (' + expression + ')')
        
        return text
    

    def SovietToMashtots(text, isShowPath = True):
        #length, expression, replacement
        expression = " "
        replacement = " "

        if type(isShowPath) is not bool:
            isShowPath = False
        

        # word parts that have no rules
        for i in range(0, len(ArmenianOrthographyConverter.WordsParts)):
            expression = ArmenianOrthographyConverter.WordsParts[i][0]
            replacement = ArmenianOrthographyConverter.WordsParts[i][1]
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        

        # main spelling
        for i in range(0, len(ArmenianOrthographyConverter.Data)):
            expression = ArmenianOrthographyConverter.Data[i][0]
            replacement = ArmenianOrthographyConverter.Data[i][1]
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        
        # for mistakes in the word make right
        for i in range(0, len(ArmenianOrthographyConverter.ErrorCorrectionSovietToMashtotsInTheWord)):
            expression = ArmenianOrthographyConverter.ErrorCorrectionSovietToMashtotsInTheWord[i][0]
            replacement = ArmenianOrthographyConverter.ErrorCorrectionSovietToMashtotsInTheWord[i][1]
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        
        # for mistakes make right
        for i in range(0, len(ArmenianOrthographyConverter.ErrorCorrectionSovietToMashtots)):
            expression = '(' + ArmenianOrthographyConverter.Start + ')'
            expression += ArmenianOrthographyConverter.ErrorCorrectionSovietToMashtots[i][0]
            expression += '(' + ArmenianOrthographyConverter.End + ')'
            replacement = r'\1' + ArmenianOrthographyConverter.ErrorCorrectionSovietToMashtots[i][1] + '\2'
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        pattern = r'\b' + re.escape("սրա") + r'\b'

        # Perform the replacement
        text = text.replace(" սրա ", " իր ")
        text = text.replace(" սրանց ", " իրենց ")
        text = text.replace(" նրա ", " անոր ")
        text = text.replace(" նրան ", " անոր ")
        text = text.replace(" նրանց ", " անոնց ")
        text = text.replace(" դա ", " այդ ")
        text = text.replace(" նա ", " ան ")
        text = text.replace(" ինձ ", " ինծի ")
        text = text.replace(" լսիր ", " լսէ ")
        text = text.replace("ների ", "ներու ")
        return text
    

    # /*
    #  Note: the reverse conversion is done in reverse order
    #  because some rules applied in chain cause unwanted
    #  side-effect, so order matters, and it needs to be
    #  reversed in the reverse conversion
    #  */
    def MashtotsToSoviet(text: str, isShowPath = True):
        expression = " "
        replacement = " "

        if type(isShowPath) is not bool:
            isShowPath = False
        

        for i in range(0, len(ArmenianOrthographyConverter.WordsParts)):
            expression = ArmenianOrthographyConverter.wordsParts[i][1]
            replacement = ArmenianOrthographyConverter.wordsParts[i][0]
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        

        for i in range(0, len(ArmenianOrthographyConverter.Data)):
            expression = ArmenianOrthographyConverter.data[i][2]
            replacement = ArmenianOrthographyConverter.data[i][3]
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        
        # for mistakes in the word make right
        for i in range(0, len(ArmenianOrthographyConverter.errorCorrectionMashtotsToSovietInTheWord)):
            expression = ArmenianOrthographyConverter.errorCorrectionMashtotsToSovietInTheWord[i][0]
            replacement = ArmenianOrthographyConverter.errorCorrectionMashtotsToSovietInTheWord[i][1]
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        

        for i in range(0, len(ArmenianOrthographyConverter.errorCorrectionMashtotsToSoviet)):
            expression = '(' + ArmenianOrthographyConverter.start + ')'
            expression += ArmenianOrthographyConverter.errorCorrectionMashtotsToSoviet[i][0]
            expression += '(' + ArmenianOrthographyConverter.end + ')'
            replacement = rf'\1{ArmenianOrthographyConverter.errorCorrectionMashtotsToSoviet[i][1]}\2'
            text = ArmenianOrthographyConverter.replace(text, expression, replacement, isShowPath)
        
        return text
    

# soviet = "բարեւ անվեպ"#"Mercer հետազոտական միջազգային ընկերության` 2012 թվականի մայիսին հրապարակված տվյալներով, համեմատելով կյանքի որակը աշխարհի 221 քաղաքներում, Վիեննան հինգերորդ անգամ զբաղեցրել է առաջին տեղը[3][4]։ The Economist ամսագրի` 2011 թվականի տվյալներով տվյալներով Վիեննան հարմարավետության առումով երկրորդ տեղն է զբաղեցրել Մելբուրնից հետո"
# print(ArmenianOrthographyConverter.SovietToMashtots(soviet))
# print("\1")